InformationRegisters/бит_ПаспортныеДанныеПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПаспортныеДанныеПроживающих</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументВид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ДокументыУдостоверяющиеЛичность</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьДокументыУдостоверяющиеЛичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрацииПоМестуЖительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументПричинаЗамены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ПаспортныеДанныеПроживающих/Forms/ФормаЗаписиДополнительнаяУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФизЛицоПриОткрытии                  = РегистрСведенийМенеджерЗаписи.ФизЛицо;
	ПериодПриОткрытии             		= РегистрСведенийМенеджерЗаписи.Период;
	ДокументВидПриОткрытии        		= РегистрСведенийМенеджерЗаписи.ДокументВид;
	ДокументДатаВыдачиПриОткрытии 		= РегистрСведенийМенеджерЗаписи.ДокументДатаВыдачи;
	ДокументКемВыданПриОткрытии  		= РегистрСведенийМенеджерЗаписи.ДокументКемВыдан;
	ДокументКодПодразделенияПриОткрытии = РегистрСведенийМенеджерЗаписи.ДокументКодПодразделения;
	ДокументНомерПриОткрытии      		= РегистрСведенийМенеджерЗаписи.ДокументНомер;
	ДокументСерияПриОткрытии      		= РегистрСведенийМенеджерЗаписи.ДокументСерия;
	ДокументПричинаЗаменыПриОткрытии    = РегистрСведенийМенеджерЗаписи.ДокументПричинаЗамены;
	Заголовок                           = Заголовок + " " + РегистрСведенийМенеджерЗаписи.ФизЛицо.Наименование;
	
	Прочитать();
	
	// У записи обязательно должны быть заполнены реквизиты ФизЛицо и Период
	Если РегистрСведенийМенеджерЗаписи.ФизЛицо.Пустая() Тогда
		
	    РегистрСведенийМенеджерЗаписи.ФизЛицо = ФизЛицоПриОткрытии;
		РегистрСведенийМенеджерЗаписи.Период  = ПериодПриОткрытии;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Если поменяли дату, то тогда новая  запись
	Если ПериодПриОткрытии <> РегистрСведенийМенеджерЗаписи.Период Тогда
		
		// Если что-то поменяли тогда запишем 
		Если ДокументВидПриОткрытии <> РегистрСведенийМенеджерЗаписи.ДокументВид ИЛИ
			ДокументДатаВыдачиПриОткрытии <> РегистрСведенийМенеджерЗаписи.ДокументДатаВыдачи ИЛИ
			ДокументКемВыданПриОткрытии <> РегистрСведенийМенеджерЗаписи.ДокументКемВыдан ИЛИ
			ДокументКодПодразделенияПриОткрытии <> РегистрСведенийМенеджерЗаписи.ДокументКодПодразделения ИЛИ
			ДокументНомерПриОткрытии <> РегистрСведенийМенеджерЗаписи.ДокументНомер ИЛИ
			ДокументСерияПриОткрытии <> РегистрСведенийМенеджерЗаписи.ДокументСерия ИЛИ
			ДокументПричинаЗаменыПриОткрытии <> РегистрСведенийМенеджерЗаписи.ДокументПричинаЗамены Тогда
		
			МенеджерЗаписи = РегистрыСведений.бит_ПаспортныеДанныеПроживающих.СоздатьМенеджерЗаписи();
			
			МенеджерЗаписи.Период                   = ПериодПриОткрытии;
			МенеджерЗаписи.ФизЛицо                  = РегистрСведенийМенеджерЗаписи.ФизЛицо;			
			МенеджерЗаписи.ДокументВид 				= ДокументВидПриОткрытии;
			МенеджерЗаписи.ДокументДатаВыдачи	    = ДокументДатаВыдачиПриОткрытии;
			МенеджерЗаписи.ДокументКемВыдан 	    = ДокументКемВыданПриОткрытии;
			МенеджерЗаписи.ДокументКодПодразделения = ДокументКодПодразделенияПриОткрытии;
			МенеджерЗаписи.ДокументНомер	    	= ДокументНомерПриОткрытии;
			МенеджерЗаписи.ДокументСерия 			= ДокументСерияПриОткрытии; 
			МенеджерЗаписи.ДокументПричинаЗамены    = ДокументПричинаЗаменыПриОткрытии;

			МенеджерЗаписи.Записать();
			
		КонецЕсли; 
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента", "УдостоверениеЛичности"), РегистрСведенийМенеджерЗаписи.ФизЛицо);

КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура История(Команда)
	
	ПараметрыФормы = Новый Структура;
	Отбор          = Новый Структура;
	
	Отбор.Вставить("ФизЛицо", РегистрСведенийМенеджерЗаписи.ФизЛицо);
	
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("РегистрСведений.бит_ПаспортныеДанныеПроживающих.Форма.ФормаЗаписиДополнительнаяУправляемая", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти
